const oracle = [
  {
    day: "甲子",
    a: "甲子卜，㱿贞：",
    b: "作邑于洮，若？",
    c: "王占曰：",
    d: "吉，无咎。"
  },
  {
    day: "乙丑",
    a: "乙丑卜，宾贞：",
    b: "翌丁卯侑于姚庚，五羊？",
    c: "王占曰：",
    d: "受祐，大吉。"
  },
  {
    day: "丙寅",
    a: "丙寅卜，争贞：",
    b: "王梦兕，其有来嬿？",
    c: "王占曰：",
    d: "有喜，吉。"
  },
  {
    day: "丁卯",
    a: "丁卯卜，古贞：",
    b: "往狩于孟，擒？",
    c: "王占曰：",
    d: "今日行，无艰。"
  },
  {
    day: "戊辰",
    a: "戊辰卜，㱿贞：",
    b: "飨多子，若？",
    c: "王占曰：",
    d: "食，吉。"
  },
  {
    day: "己巳",
    a: "己巳卜，宾贞：",
    b: "新寝成，宁？",
    c: "王占曰：",
    d: "居，吉。"
  },
  {
    day: "庚午",
    a: "庚午卜，争贞：",
    b: "作舟于河，其涉？",
    c: "王占曰：",
    d: "作，吉，无不利。"
  },
  {
    day: "辛未",
    a: "辛未卜，古贞：",
    b: "使人往沚，其复？",
    c: "王占曰：",
    d: "往，吉。"
  },
  {
    day: "壬申",
    a: "壬申卜，㱿贞：",
    b: "启扉祀于旦，若？",
    c: "王占曰：",
    d: "启，吉。"
  },
  {
    day: "癸酉",
    a: "癸酉卜，宾贞：",
    b: "王疾齿，御于父乙？",
    c: "王占曰：",
    d: "身无疾，吉。"
  },

  {
    day: "甲戌",
    a: "甲戌卜，争贞：",
    b: "王寝，其宁？",
    c: "王占曰：",
    d: "寝，宁。"
  },
  {
    day: "乙亥",
    a: "乙亥卜，古贞：",
    b: "妇好示子，若？",
    c: "王占曰：",
    d: "家人，和。"
  },
  {
    day: "丙子",
    a: "丙子卜，㱿贞：",
    b: "年于河，受年？",
    c: "王占曰：",
    d: "年，有秋。"
  },
  {
    day: "丁丑",
    a: "丁丑卜，宾贞：",
    b: "田于敦，其获？",
    c: "王占曰：",
    d: "田，获。"
  },
  {
    day: "戊寅",
    a: "戊寅卜，争贞：",
    b: "王心若沚，其忧？",
    c: "王占曰：",
    d: "心，宁。"
  },
  {
    day: "己卯",
    a: "己卯卜，古贞：",
    b: "艰自西，其告？",
    c: "王占曰：",
    d: "勿忧，吉。"
  },
  {
    day: "庚辰",
    a: "庚辰卜，㱿贞：",
    b: "祀中彡，其静？",
    c: "王占曰：",
    d: "静，无咎。"
  },
  {
    day: "辛巳",
    a: "辛巳卜，宾贞：",
    b: "禘于成汤，三牛？",
    c: "王占曰：",
    d: "吉，无咎。"
  },
  {
    day: "壬午",
    a: "壬午卜，争贞：",
    b: "王往逐兕，亡灾？",
    c: "王占曰：",
    d: "受祐，大吉。"
  },
  {
    day: "癸未",
    a: "癸未卜，古贞：",
    b: "有云自东，其雨？",
    c: "王占曰：",
    d: "有喜，吉。"
  },
  {
    day: "甲申",
    a: "甲申卜，㱿贞：",
    b: "步自冥至丧，亡祸？",
    c: "王占曰：",
    d: "今日行，无艰。"
  },
  {
    day: "乙酉",
    a: "乙酉卜，宾贞：",
    b: "登黍于祖乙，若？",
    c: "王占曰：",
    d: "食，吉。"
  },
  {
    day: "丙戌",
    a: "丙戌卜，争贞：",
    b: "入于新宗，宁？",
    c: "王占曰：",
    d: "居，吉。"
  },
  {
    day: "丁亥",
    a: "丁亥卜，古贞：",
    b: "作戈三百，用？",
    c: "王占曰：",
    d: "作，吉，无不利。"
  },
  {
    day: "戊子",
    a: "戊子卜，㱿贞：",
    b: "使人入羌，其来？",
    c: "王占曰：",
    d: "往，吉。"
  },
  {
    day: "己丑",
    a: "己丑卜，宾贞：",
    b: "启庙门，侑于上甲？",
    c: "王占曰：",
    d: "启，吉。"
  },
  {
    day: "庚寅",
    a: "庚寅卜，争贞：",
    b: "小王疾目，御于母庚？",
    c: "王占曰：",
    d: "身无疾，吉。"
  },
  {
    day: "辛卯",
    a: "辛卯卜，古贞：",
    b: "夕寝，有梦？",
    c: "王占曰：",
    d: "寝，宁。"
  },
  {
    day: "壬辰",
    a: "壬辰卜，㱿贞：",
    b: "多子入学，若？",
    c: "王占曰：",
    d: "家人，和。"
  },
  {
    day: "癸巳",
    a: "癸巳卜，宾贞：",
    b: "祷年于岳，受禾？",
    c: "王占曰：",
    d: "年，有秋。"
  },
  {
    day: "甲午",
    a: "甲午卜，争贞：",
    b: "狩于斿，擒狐？",
    c: "王占曰：",
    d: "田，获。"
  },
  {
    day: "乙未",
    a: "乙未卜，古贞：",
    b: "王心惕，其有祟？",
    c: "王占曰：",
    d: "心，宁。"
  },
  {
    day: "丙申",
    a: "丙申卜，㱿贞：",
    b: "方不出，其忧？",
    c: "王占曰：",
    d: "勿忧，吉。"
  },
  {
    day: "丁酉",
    a: "丁酉卜，宾贞：",
    b: "夕祼，其喧？",
    c: "王占曰：",
    d: "静，无咎。"
  },
  {
    day: "戊戌",
    a: "戊戌卜，争贞：",
    b: "御于高祖夒，十豕？",
    c: "王占曰：",
    d: "吉，无咎。"
  },
  {
    day: "己亥",
    a: "己亥卜，古贞：",
    b: "王射麋，擒？",
    c: "王占曰：",
    d: "受祐，大吉。"
  },
  {
    day: "庚子",
    a: "庚子卜，㱿贞：",
    b: "虹饮于河，有咎？",
    c: "王占曰：",
    d: "有喜，吉。"
  },
  {
    day: "辛丑",
    a: "辛丑卜，宾贞：",
    b: "涉洹，亡祸？",
    c: "王占曰：",
    d: "今日行，无艰。"
  },
  {
    day: "壬寅",
    a: "壬寅卜，争贞：",
    b: "以鬯酒侑妣癸，若？",
    c: "王占曰：",
    d: "食，吉。"
  },
  {
    day: "癸卯",
    a: "癸卯卜，古贞：",
    b: "入于洮室，宁？",
    c: "王占曰：",
    d: "居，吉。"
  },
  {
    day: "甲辰",
    a: "甲辰卜，㱿贞：",
    b: "作圉于羌，若？",
    c: "王占曰：",
    d: "作，吉，无不利。"
  },
  {
    day: "乙巳",
    a: "乙巳卜，宾贞：",
    b: "往于巂，以众？",
    c: "王占曰：",
    d: "往，吉。"
  },
  {
    day: "丙午",
    a: "丙午卜，争贞：",
    b: "启仓廪，祀河？",
    c: "王占曰：",
    d: "启，吉。"
  },
  {
    day: "丁未",
    a: "丁未卜，古贞：",
    b: "妇鼠疾首，御于母丙？",
    c: "王占曰：",
    d: "身无疾，吉。"
  },
  {
    day: "戊申",
    a: "戊申卜，㱿贞：",
    b: "王夙夜，其宁？",
    c: "王占曰：",
    d: "寝，宁。"
  },
  {
    day: "己酉",
    a: "己酉卜，宾贞：",
    b: "多妣协祀，无聒？",
    c: "王占曰：",
    d: "家人，和。"
  },
  {
    day: "庚戌",
    a: "庚戌卜，争贞：",
    b: "祷于土，受年？",
    c: "王占曰：",
    d: "年，有秋。"
  },
  {
    day: "辛亥",
    a: "辛亥卜，古贞：",
    b: "渔于渊，其获？",
    c: "王占曰：",
    d: "田，获。"
  },
  {
    day: "壬子",
    a: "壬子卜，㱿贞：",
    b: "王心荡，其有艰？",
    c: "王占曰：",
    d: "心，宁。"
  },
  {
    day: "癸丑",
    a: "癸丑卜，宾贞：",
    b: "艰自北，勿忧？",
    c: "王占曰：",
    d: "勿忧，吉。"
  },
  {
    day: "甲寅",
    a: "甲寅卜，争贞：",
    b: "夕告于祖，其嚣？",
    c: "王占曰：",
    d: "静，无咎。"
  },
  {
    day: "乙卯",
    a: "乙卯卜，古贞：",
    b: "禘于伊尹，五豕？",
    c: "王占曰：",
    d: "吉，无咎。"
  },
  {
    day: "丙辰",
    a: "丙辰卜，㱿贞：",
    b: "王逐豕于膏，亡灾？",
    c: "王占曰：",
    d: "受祐，大吉。"
  },
  {
    day: "丁巳",
    a: "丁巳卜，宾贞：",
    b: "凤隹它，不惟孽？",
    c: "王占曰：",
    d: "有喜，吉。"
  },
  {
    day: "戊午",
    a: "戊午卜，争贞：",
    b: "步于攸，往来亡祸？",
    c: "王占曰：",
    d: "今日行，无艰。"
  },
  {
    day: "己未",
    a: "己未卜，古贞：",
    b: "登粱于父丁，若？",
    c: "王占曰：",
    d: "食，吉。"
  },
  {
    day: "庚申",
    a: "庚申卜，㱿贞：",
    b: "入于盟室，安？",
    c: "王占曰：",
    d: "居，吉。"
  },
  {
    day: "辛酉",
    a: "辛酉卜，宾贞：",
    b: "作册于西隃，若？",
    c: "王占曰：",
    d: "作，吉，无不利。"
  },
  {
    day: "壬戌",
    a: "壬戌卜，争贞：",
    b: "使人于亳，其得？",
    c: "王占曰：",
    d: "往，吉。"
  },
  {
    day: "癸亥",
    a: "癸亥卜，古贞：",
    b: "启酉祀，彡于唐？",
    c: "王占曰：",
    d: "启，吉。"
  }
];

module.exports = oracle;